<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download latest TextWrangler, build a .bes deployment file and import it into the console.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.bigfix.textwrangler</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TextWrangler</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.textwrangler</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>BESUploader</string>
            <key>Arguments</key>
            <dict>
                <key>bes_uploadpath</key>
                <string>%pathname%</string>
                <key>BES_ROOTSERVER</key>
                <string>https://besconsole.institution.edu:52311/api</string>
                <key>BES_USERNAME</key>
                <string>APICONSOLEUSERNAME</string>
                <key>BES_PASSWORD</key>
                <string>APICONSOLEPASSWORD</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>bes_overrideurl</key>
                <string>%bes_uploadurl%</string>
                <key>bes_filename</key>
                <string>%NAME%.dmg</string>
                <key>bes_version</key>
                <string>%version%</string>
                <key>bes_title</key>
                <string>Install/Upgrade: Bare Bones %NAME% %version% - Mac OS X</string>
                <key>bes_description</key>
                <string><![CDATA[<DIV class=subsection>
<P><FONT size=3><STRONG>About&nbsp; Bare Bones TextWrangler</STRONG></FONT></P><FONT size=2>
<BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
<P>TextWrangler is the powerful general purpose text editor, and Unix and server administrator's tool. Oh, and also, like the best things in life, it's free.</P>
<P><A http://www.barebones.com/products/textwrangler/">http://www.barebones.com/products/textwrangler/</A></P></BLOCKQUOTE>
<P dir=ltr><STRONG><FONT color=#0080ff size=3>Licensing</FONT></STRONG></P>
<BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
<P dir=ltr>Bare Bones TextWrangler&nbsp;is freeware.</P></BLOCKQUOTE></FONT><STRONG>
<P><FONT size=3>About This Task</FONT></P></STRONG>
<BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
<P>This task will install/upgrade: %NAME% %version%<BR></P>
<P>This task is applicable on: Mac OS X 10.6.8 or later</P></BLOCKQUOTE>
<P><FONT size=3><STRONG>Action Description</STRONG></FONT></P>
<UL>
<LI><FONT size=2><STRONG>Action1: Install/upgrade.</STRONG></FONT></LI></UL>
<BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
<P><FONT size=2>This action installs the %NAME% %version%, the bundled command line tools and disables updates.</FONT></P></BLOCKQUOTE></DIV>]]></string>
                <key>bes_category</key>
                <string>Software Sharing</string>
                <key>bes_relevance</key>
                <array>
                    <string>mac of operating system</string>
                    <string>system version &gt;= "10.6.8"</string>
                    <string>not exists folder "/Applications/%NAME%.app" whose (version of it &gt;= "%version%" as version)</string>
                </array>
                <key>bes_actions</key>
                <dict>
                    <key>1</key>
                    <dict>
                        <key>ActionName</key>
                        <string>DefaultAction</string>
                        <key>ActionNumber</key>
                        <string>Action1</string>
                        <key>ActionScript</key>
                        <string>

delete "/tmp/TextWrangler.dmg"
move "__Download/TextWrangler.dmg" "/tmp/TextWrangler.dmg"

wait /usr/bin/hdiutil attach -quiet -nobrowse -mountpoint "/tmp/TextWrangler" "/tmp/TextWrangler.dmg"

continue if {exists folder "/tmp/TextWrangler/TextWrangler.app"}

wait /bin/rm -rf "/Applications/TextWrangler.app"
wait /bin/cp -Rfp "/tmp/TextWrangler/TextWrangler.app" "/Applications"

wait /bin/mkdir -p /usr/local/bin

wait /bin/ln -sf /Applications/TextWrangler.app/Contents/Helpers/edit /usr/local/bin/edit
wait /bin/ln -sf /Applications/TextWrangler.app/Contents/Helpers/twdiff /usr/local/bin/twdiff
wait /bin/ln -sf /Applications/TextWrangler.app/Contents/Helpers/twfind /usr/local/bin/twfind

wait /usr/bin/defaults write /Library/Preferences/com.barebones.textwrangler SUSoftwareUpdateEnabled -bool NO
wait /usr/bin/defaults write /Library/Preferences/com.barebones.textwrangler SUSoftwareUpdateHasCompletedFirstRun -bool YES
wait /usr/bin/defaults write /Library/Preferences/com.barebones.textwrangler FirstRunDialogVersion -int 1

delete "/etc/paths.d/textwrangler"
createfile until END_OF_FILE
/usr/local/bin
END_OF_FILE
copy __createfile "/etc/paths.d/textwrangler"

wait /usr/bin/hdiutil detach -force "/tmp/TextWrangler"
delete "/tmp/TextWrangler.dmg"
</string>
                   </dict>
               </dict>
            </dict>
            <key>Processor</key>
            <string>AutoPkgBESEngine</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>BESImporter</string>
            <key>Arguments</key>
            <dict>
                <key>bes_file</key>
                <string>%bes_file%</string>
                <key>bes_customsite</key>
                <string>MacDev</string>
                <key>BES_ROOTSERVER</key>
                <string>https://besconsole.institution.edu:52311/api</string>
                <key>BES_USERNAME</key>
                <string>APICONSOLEUSERNAME</string>
                <key>BES_PASSWORD</key>
                <string>APICONSOLEPASSWORD</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
